per1234/wirino/avr/boards.txt
# Based on https://github.com/WiringProject/Wiring/blob/master/framework/hardware/Wiring/boards.txt
##############################################################

menu.clock=Clock
menu.BOD=BOD
menu.bootloader=Bootloader
menu.EESAVE=Preserve EEPROM
menu.LTO=Compiler LTO

##############################################################

WiringS.name=Wiring S

WiringS.upload.tool=arduino:avrdude
WiringS.upload.maximum_data_size=4096
WiringS.upload.port=UART0

WiringS.bootloader.tool=arduino:avrdude
WiringS.bootloader.OCDEN=1
WiringS.bootloader.JTAGEN=1
WiringS.bootloader.SPIEN=0
WiringS.bootloader.WDTON=1
WiringS.bootloader.high_fuses=0b{bootloader.OCDEN}{bootloader.JTAGEN}{bootloader.SPIEN}{bootloader.WDTON}{bootloader.EESAVE}{bootloader.BOOTSZ1}{bootloader.BOOTSZ0}{bootloader.BOOTRST}
WiringS.bootloader.unlock_bits=0x3F
WiringS.bootloader.lock_bits=0x2F

WiringS.build.core=MightyCore:MCUdude_corefiles
WiringS.build.mcu=atmega644p
WiringS.build.variant=WiringS
WiringS.build.board=WIRING_S

# Clock Menu
WiringS.menu.clock.16MHz=16 MHz
WiringS.menu.clock.16MHz.upload.speed=115200
WiringS.menu.clock.16MHz.bootloader.low_fuses=0xF7
WiringS.menu.clock.16MHz.build.f_cpu=16000000L

WiringS.menu.clock.8MHz=8 MHz Internal
WiringS.menu.clock.8MHz.upload.speed=57600
WiringS.menu.clock.8MHz.bootloader.low_fuses=0xE2
WiringS.menu.clock.8MHz.build.f_cpu=8000000L

# BOD Menu
WiringS.menu.BOD.2V7=2.7 V
WiringS.menu.BOD.2V7.bootloader.extended_fuses=0xFD

WiringS.menu.BOD.4V3=4.3 V
WiringS.menu.BOD.4V3.bootloader.extended_fuses=0xFC

WiringS.menu.BOD.1V8=1.8 V
WiringS.menu.BOD.1V8.bootloader.extended_fuses=0xFE

WiringS.menu.BOD.disabled=Disabled
WiringS.menu.BOD.disabled.bootloader.extended_fuses=0xFF

# Bootloader Menu
WiringS.menu.bootloader.wiring=Wiring
WiringS.menu.bootloader.wiring.bootloader.BOOTSZ1=1
WiringS.menu.bootloader.wiring.bootloader.BOOTSZ0=0
WiringS.menu.bootloader.wiring.bootloader.BOOTRST=0
WiringS.menu.bootloader.wiring.upload.protocol=wiring
WiringS.menu.bootloader.wiring.upload.maximum_size=63488
WiringS.menu.bootloader.wiring.bootloader.file=Wiring/WiringBoot_WiringS.hex

WiringS.menu.bootloader.optiboot=Optiboot
WiringS.menu.bootloader.optiboot.bootloader.BOOTSZ1=1
WiringS.menu.bootloader.optiboot.bootloader.BOOTSZ0=1
WiringS.menu.bootloader.optiboot.bootloader.BOOTRST=0
WiringS.menu.bootloader.optiboot.upload.protocol=arduino
WiringS.menu.bootloader.optiboot.upload.maximum_size=64512
WiringS.menu.bootloader.optiboot.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex

WiringS.menu.bootloader.none=None
WiringS.menu.bootloader.none.bootloader.BOOTSZ1=1
WiringS.menu.bootloader.none.bootloader.BOOTSZ0=1
WiringS.menu.bootloader.none.bootloader.BOOTRST=1
WiringS.menu.bootloader.none.upload.maximum_size=65536
WiringS.menu.bootloader.none.bootloader.file=empty/empty_all.hex

# EESAVE Menu
WiringS.menu.EESAVE.yes=Yes
WiringS.menu.EESAVE.yes.bootloader.EESAVE=0

WiringS.menu.EESAVE.no=No
WiringS.menu.EESAVE.no.bootloader.EESAVE=1

# LTO Menu
WiringS.menu.LTO.yes=Yes
WiringS.menu.LTO.yes.compiler.c.extra_flags=-flto -fno-fat-lto-objects
WiringS.menu.LTO.yes.compiler.c.elf.extra_flags=-flto -fuse-linker-plugin
WiringS.menu.LTO.yes.compiler.S.extra_flags=-flto
WiringS.menu.LTO.yes.compiler.cpp.extra_flags=-flto -DWIRINO_COMPILER_LTO
WiringS.menu.LTO.yes.ltoarcmd=avr-gcc-ar

WiringS.menu.LTO.no=No
WiringS.menu.LTO.no.ltoarcmd=avr-ar

##############################################################

WiringSPlayShield.name=Wiring S with Play Shield

WiringSPlayShield.upload.tool=arduino:avrdude
WiringSPlayShield.upload.maximum_data_size=4096
WiringSPlayShield.upload.port=UART0

WiringSPlayShield.bootloader.tool=arduino:avrdude
WiringSPlayShield.bootloader.OCDEN=1
WiringSPlayShield.bootloader.JTAGEN=1
WiringSPlayShield.bootloader.SPIEN=0
WiringSPlayShield.bootloader.WDTON=1
WiringSPlayShield.bootloader.high_fuses=0b{bootloader.OCDEN}{bootloader.JTAGEN}{bootloader.SPIEN}{bootloader.WDTON}{bootloader.EESAVE}{bootloader.BOOTSZ1}{bootloader.BOOTSZ0}{bootloader.BOOTRST}
WiringSPlayShield.bootloader.unlock_bits=0x3F
WiringSPlayShield.bootloader.lock_bits=0x2F

WiringSPlayShield.build.core=MightyCore:MCUdude_corefiles
WiringSPlayShield.build.mcu=atmega644p
WiringSPlayShield.build.variant=WiringSPlayShield
WiringSPlayShield.build.board=WIRING_PLAY_SHIELD

# Clock Menu
WiringSPlayShield.menu.clock.16MHz=16 MHz
WiringSPlayShield.menu.clock.16MHz.upload.speed=115200
WiringSPlayShield.menu.clock.16MHz.bootloader.low_fuses=0xF7
WiringSPlayShield.menu.clock.16MHz.build.f_cpu=16000000L

WiringSPlayShield.menu.clock.8MHz=8 MHz Internal
WiringSPlayShield.menu.clock.8MHz.upload.speed=57600
WiringSPlayShield.menu.clock.8MHz.bootloader.low_fuses=0xE2
WiringSPlayShield.menu.clock.8MHz.build.f_cpu=8000000L

# BOD Menu
WiringSPlayShield.menu.BOD.2V7=2.7 V
WiringSPlayShield.menu.BOD.2V7.bootloader.extended_fuses=0xFD

WiringSPlayShield.menu.BOD.4V3=4.3 V
WiringSPlayShield.menu.BOD.4V3.bootloader.extended_fuses=0xFC

WiringSPlayShield.menu.BOD.1V8=1.8 V
WiringSPlayShield.menu.BOD.1V8.bootloader.extended_fuses=0xFE

WiringSPlayShield.menu.BOD.disabled=Disabled
WiringSPlayShield.menu.BOD.disabled.bootloader.extended_fuses=0xFF

# Bootloader Menu
WiringSPlayShield.menu.bootloader.wiring=Wiring
WiringSPlayShield.menu.bootloader.wiring.bootloader.BOOTSZ1=1
WiringSPlayShield.menu.bootloader.wiring.bootloader.BOOTSZ0=0
WiringSPlayShield.menu.bootloader.wiring.bootloader.BOOTRST=0
WiringSPlayShield.menu.bootloader.wiring.upload.protocol=wiring
WiringSPlayShield.menu.bootloader.wiring.upload.maximum_size=63488
WiringSPlayShield.menu.bootloader.wiring.bootloader.file=Wiring/WiringBoot_WiringS.hex

WiringSPlayShield.menu.bootloader.optiboot=Optiboot
WiringSPlayShield.menu.bootloader.optiboot.bootloader.BOOTSZ1=1
WiringSPlayShield.menu.bootloader.optiboot.bootloader.BOOTSZ0=1
WiringSPlayShield.menu.bootloader.optiboot.bootloader.BOOTRST=0
WiringSPlayShield.menu.bootloader.optiboot.upload.protocol=arduino
WiringSPlayShield.menu.bootloader.optiboot.upload.maximum_size=64512
WiringSPlayShield.menu.bootloader.optiboot.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex

