per1234/wirino/avr/boards.txt
WiringSPlayShield.menu.bootloader.none=None
WiringSPlayShield.menu.bootloader.none.bootloader.BOOTSZ1=1
WiringSPlayShield.menu.bootloader.none.bootloader.BOOTSZ0=1
WiringSPlayShield.menu.bootloader.none.bootloader.BOOTRST=1
WiringSPlayShield.menu.bootloader.none.upload.maximum_size=65536
WiringSPlayShield.menu.bootloader.none.bootloader.file=empty/empty_all.hex

# EESAVE Menu
WiringSPlayShield.menu.EESAVE.yes=Yes
WiringSPlayShield.menu.EESAVE.yes.bootloader.EESAVE=0

WiringSPlayShield.menu.EESAVE.no=No
WiringSPlayShield.menu.EESAVE.no.bootloader.EESAVE=1

# LTO Menu
WiringSPlayShield.menu.LTO.yes=Yes
WiringSPlayShield.menu.LTO.yes.compiler.c.extra_flags=-flto -fno-fat-lto-objects
WiringSPlayShield.menu.LTO.yes.compiler.c.elf.extra_flags=-flto -fuse-linker-plugin
WiringSPlayShield.menu.LTO.yes.compiler.S.extra_flags=-flto
WiringSPlayShield.menu.LTO.yes.compiler.cpp.extra_flags=-flto -DWIRINO_COMPILER_LTO
WiringSPlayShield.menu.LTO.yes.ltoarcmd=avr-gcc-ar

WiringSPlayShield.menu.LTO.no=No
WiringSPlayShield.menu.LTO.no.ltoarcmd=avr-ar

##############################################################

WiringV1.name=Wiring V1.0/Wiring Mini V1.0

WiringV1.upload.tool=arduino:avrdude
WiringV1.upload.maximum_data_size=4096
WiringV1.upload.port=UART0

WiringV1.bootloader.tool=arduino:avrdude
WiringV1.bootloader.OCDEN=1
WiringV1.bootloader.JTAGEN=1
WiringV1.bootloader.SPIEN=0
WiringV1.bootloader.low_fuses=0b{bootloader.BODLEVEL}{bootloader.BODEN}{bootloader.SUT1}{bootloader.SUT0}{bootloader.CKSEL3}{bootloader.CKSEL2}{bootloader.CKSEL1}{bootloader.CKSEL0}
WiringV1.bootloader.high_fuses=0b{bootloader.OCDEN}{bootloader.JTAGEN}{bootloader.SPIEN}{bootloader.CKOPT}{bootloader.EESAVE}{bootloader.BOOTSZ1}{bootloader.BOOTSZ0}{bootloader.BOOTRST}
WiringV1.bootloader.extended_fuses=0xFF
WiringV1.bootloader.unlock_bits=0x3F
WiringV1.bootloader.lock_bits=0x2F

WiringV1.build.core=MegaCore:MCUdude_corefiles
WiringV1.build.variant=Wiring1
WiringV1.build.board=WIRING_1_0
WiringV1.build.mcu=atmega128

# Clock Menu
WiringV1.menu.clock.16MHz=16 MHz
WiringV1.menu.clock.16MHz.upload.speed=115200
WiringV1.menu.clock.16MHz.bootloader.SUT1=1
WiringV1.menu.clock.16MHz.bootloader.SUT0=1
WiringV1.menu.clock.16MHz.bootloader.CKSEL3=1
WiringV1.menu.clock.16MHz.bootloader.CKSEL2=1
WiringV1.menu.clock.16MHz.bootloader.CKSEL1=1
WiringV1.menu.clock.16MHz.bootloader.CKSEL0=1
WiringV1.menu.clock.16MHz.bootloader.CKOPT=0
WiringV1.menu.clock.16MHz.build.f_cpu=16000000L

WiringV1.menu.clock.8MHz=8 MHz Internal
WiringV1.menu.clock.8MHz.upload.speed=57600
WiringV1.menu.clock.8MHz.bootloader.SUT1=1
WiringV1.menu.clock.8MHz.bootloader.SUT0=0
WiringV1.menu.clock.8MHz.bootloader.CKSEL3=0
WiringV1.menu.clock.8MHz.bootloader.CKSEL2=1
WiringV1.menu.clock.8MHz.bootloader.CKSEL1=0
WiringV1.menu.clock.8MHz.bootloader.CKSEL0=0
WiringV1.menu.clock.8MHz.bootloader.CKOPT=1
WiringV1.menu.clock.8MHz.build.f_cpu=8000000L

# BOD Menu
WiringV1.menu.BOD.2V7=2.7 V
WiringV1.menu.BOD.2V7.bootloader.BODLEVEL=1
WiringV1.menu.BOD.2V7.bootloader.BODEN=0

WiringV1.menu.BOD.4V0=4.0 V
WiringV1.menu.BOD.4V0.bootloader.BODLEVEL=0
WiringV1.menu.BOD.4V0.bootloader.BODEN=0

WiringV1.menu.BOD.disabled=Disabled
WiringV1.menu.BOD.disabled.bootloader.BODLEVEL=1
WiringV1.menu.BOD.disabled.bootloader.BODEN=1

# Bootloader Menu
WiringV1.menu.bootloader.wiring=Wiring
WiringV1.menu.bootloader.wiring.bootloader.BOOTSZ1=1
WiringV1.menu.bootloader.wiring.bootloader.BOOTSZ0=0
WiringV1.menu.bootloader.wiring.bootloader.BOOTRST=0
WiringV1.menu.bootloader.wiring.upload.protocol=wiring
WiringV1.menu.bootloader.wiring.upload.maximum_size=129024
WiringV1.menu.bootloader.wiring.bootloader.file=Wiring/WiringBoot_Wiring-V1-Mega.hex

WiringV1.menu.bootloader.optiboot=Optiboot
WiringV1.menu.bootloader.optiboot.bootloader.BOOTSZ1=1
WiringV1.menu.bootloader.optiboot.bootloader.BOOTSZ0=1
WiringV1.menu.bootloader.optiboot.bootloader.BOOTRST=0
WiringV1.menu.bootloader.optiboot.upload.protocol=arduino
WiringV1.menu.bootloader.optiboot.upload.maximum_size=130048
WiringV1.menu.bootloader.optiboot.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex

WiringV1.menu.bootloader.none=None
WiringV1.menu.bootloader.none.bootloader.BOOTSZ1=1
WiringV1.menu.bootloader.none.bootloader.BOOTSZ0=1
WiringV1.menu.bootloader.none.bootloader.BOOTRST=1
WiringV1.menu.bootloader.none.upload.maximum_size=131072
WiringV1.menu.bootloader.none.bootloader.file=empty/empty_all.hex

# EESAVE Menu
WiringV1.menu.EESAVE.no=No
WiringV1.menu.EESAVE.no.bootloader.EESAVE=1

WiringV1.menu.EESAVE.yes=Yes
WiringV1.menu.EESAVE.yes.bootloader.EESAVE=0

# LTO Menu
WiringV1.menu.LTO.yes=Yes
WiringV1.menu.LTO.yes.compiler.c.extra_flags=-flto -fno-fat-lto-objects
WiringV1.menu.LTO.yes.compiler.c.elf.extra_flags=-flto -fuse-linker-plugin
WiringV1.menu.LTO.yes.compiler.S.extra_flags=-flto
WiringV1.menu.LTO.yes.compiler.cpp.extra_flags=-flto -DWIRINO_COMPILER_LTO
WiringV1.menu.LTO.yes.ltoarcmd=avr-gcc-ar

WiringV1.menu.LTO.no=No
WiringV1.menu.LTO.no.ltoarcmd=avr-ar

##############################################################

WiringV1Sparkfun1281.name=Wiring V1.1 ATmega1281

WiringV1Sparkfun1281.upload.tool=arduino:avrdude
WiringV1Sparkfun1281.upload.maximum_data_size=8192
WiringV1Sparkfun1281.upload.port=UART0

WiringV1Sparkfun1281.bootloader.tool=arduino:avrdude
WiringV1Sparkfun1281.bootloader.OCDEN=1
WiringV1Sparkfun1281.bootloader.JTAGEN=1
WiringV1Sparkfun1281.bootloader.SPIEN=0
WiringV1Sparkfun1281.bootloader.WDTON=1
WiringV1Sparkfun1281.bootloader.high_fuses=0b{bootloader.OCDEN}{bootloader.JTAGEN}{bootloader.SPIEN}{bootloader.WDTON}{bootloader.EESAVE}{bootloader.BOOTSZ1}{bootloader.BOOTSZ0}{bootloader.BOOTRST}
WiringV1Sparkfun1281.bootloader.unlock_bits=0x3F
WiringV1Sparkfun1281.bootloader.lock_bits=0x2F

WiringV1Sparkfun1281.build.core=MegaCore:MCUdude_corefiles
WiringV1Sparkfun1281.build.variant=Wiring1
WiringV1Sparkfun1281.build.board=WIRING_1_1_1281
WiringV1Sparkfun1281.build.mcu=atmega1281

