per1234/wirino/avr/boards.txt
# Clock Menu
WiringV1Sparkfun1281.menu.clock.16MHz=16 MHz
WiringV1Sparkfun1281.menu.clock.16MHz.upload.speed=115200
WiringV1Sparkfun1281.menu.clock.16MHz.bootloader.low_fuses=0xF7
WiringV1Sparkfun1281.menu.clock.16MHz.build.f_cpu=16000000L

WiringV1Sparkfun1281.menu.clock.8MHz=8 MHz Internal
WiringV1Sparkfun1281.menu.clock.8MHz.upload.speed=57600
WiringV1Sparkfun1281.menu.clock.8MHz.bootloader.low_fuses=0xE2
WiringV1Sparkfun1281.menu.clock.8MHz.build.f_cpu=8000000L

# BOD Menu
WiringV1Sparkfun1281.menu.BOD.2V7=2.7 V
WiringV1Sparkfun1281.menu.BOD.2V7.bootloader.extended_fuses=0xFD

WiringV1Sparkfun1281.menu.BOD.4V3=4.3 V
WiringV1Sparkfun1281.menu.BOD.4V3.bootloader.extended_fuses=0xFC

WiringV1Sparkfun1281.menu.BOD.1V8=1.8 V
WiringV1Sparkfun1281.menu.BOD.1V8.bootloader.extended_fuses=0xFE

WiringV1Sparkfun1281.menu.BOD.disabled=Disabled
WiringV1Sparkfun1281.menu.BOD.disabled.bootloader.extended_fuses=0xFF

# Bootloader Menu
WiringV1Sparkfun1281.menu.bootloader.wiring=Wiring
WiringV1Sparkfun1281.menu.bootloader.wiring.bootloader.BOOTSZ1=1
WiringV1Sparkfun1281.menu.bootloader.wiring.bootloader.BOOTSZ0=0
WiringV1Sparkfun1281.menu.bootloader.wiring.bootloader.BOOTRST=0
WiringV1Sparkfun1281.menu.bootloader.wiring.upload.protocol=wiring
WiringV1Sparkfun1281.menu.bootloader.wiring.upload.maximum_size=129024
WiringV1Sparkfun1281.menu.bootloader.wiring.bootloader.file=Wiring/WiringBoot_Wiring-V1.1-1281.hex

WiringV1Sparkfun1281.menu.bootloader.optiboot=Optiboot
WiringV1Sparkfun1281.menu.bootloader.optiboot.bootloader.BOOTSZ1=1
WiringV1Sparkfun1281.menu.bootloader.optiboot.bootloader.BOOTSZ0=1
WiringV1Sparkfun1281.menu.bootloader.optiboot.bootloader.BOOTRST=0
WiringV1Sparkfun1281.menu.bootloader.optiboot.upload.protocol=arduino
WiringV1Sparkfun1281.menu.bootloader.optiboot.upload.maximum_size=130048
WiringV1Sparkfun1281.menu.bootloader.optiboot.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex

WiringV1Sparkfun1281.menu.bootloader.none=None
WiringV1Sparkfun1281.menu.bootloader.none.bootloader.BOOTSZ1=1
WiringV1Sparkfun1281.menu.bootloader.none.bootloader.BOOTSZ0=1
WiringV1Sparkfun1281.menu.bootloader.none.bootloader.BOOTRST=1
WiringV1Sparkfun1281.menu.bootloader.none.upload.maximum_size=131072
WiringV1Sparkfun1281.menu.bootloader.none.bootloader.file=empty/empty_all.hex

# EESAVE Menu
WiringV1Sparkfun1281.menu.EESAVE.yes=Yes
WiringV1Sparkfun1281.menu.EESAVE.yes.bootloader.EESAVE=0

WiringV1Sparkfun1281.menu.EESAVE.no=No
WiringV1Sparkfun1281.menu.EESAVE.no.bootloader.EESAVE=1

# LTO Menu
WiringV1Sparkfun1281.menu.LTO.yes=Yes
WiringV1Sparkfun1281.menu.LTO.yes.compiler.c.extra_flags=-flto -fno-fat-lto-objects
WiringV1Sparkfun1281.menu.LTO.yes.compiler.c.elf.extra_flags=-flto -fuse-linker-plugin
WiringV1Sparkfun1281.menu.LTO.yes.compiler.S.extra_flags=-flto
WiringV1Sparkfun1281.menu.LTO.yes.compiler.cpp.extra_flags=-flto -DWIRINO_COMPILER_LTO
WiringV1Sparkfun1281.menu.LTO.yes.ltoarcmd=avr-gcc-ar

WiringV1Sparkfun1281.menu.LTO.no=No
WiringV1Sparkfun1281.menu.LTO.no.ltoarcmd=avr-ar

##############################################################

WiringV1Sparkfun2561.name=Wiring V1.1 ATmega2561

WiringV1Sparkfun2561.upload.tool=arduino:avrdude
WiringV1Sparkfun2561.upload.maximum_data_size=8192
WiringV1Sparkfun2561.upload.port=UART0

WiringV1Sparkfun2561.bootloader.tool=arduino:avrdude
WiringV1Sparkfun2561.bootloader.OCDEN=1
WiringV1Sparkfun2561.bootloader.JTAGEN=1
WiringV1Sparkfun2561.bootloader.SPIEN=0
WiringV1Sparkfun2561.bootloader.WDTON=1
WiringV1Sparkfun2561.bootloader.high_fuses=0b{bootloader.OCDEN}{bootloader.JTAGEN}{bootloader.SPIEN}{bootloader.WDTON}{bootloader.EESAVE}{bootloader.BOOTSZ1}{bootloader.BOOTSZ0}{bootloader.BOOTRST}
WiringV1Sparkfun2561.bootloader.unlock_bits=0x3F
WiringV1Sparkfun2561.bootloader.lock_bits=0x2F

WiringV1Sparkfun2561.build.core=MegaCore:MCUdude_corefiles
WiringV1Sparkfun2561.build.variant=Wiring1
WiringV1Sparkfun2561.build.board=WIRING_1_1_2561
WiringV1Sparkfun2561.build.mcu=atmega2561

# Clock Menu
WiringV1Sparkfun2561.menu.clock.16MHz=16 MHz
WiringV1Sparkfun2561.menu.clock.16MHz.upload.speed=115200
WiringV1Sparkfun2561.menu.clock.16MHz.bootloader.low_fuses=0xF7
WiringV1Sparkfun2561.menu.clock.16MHz.build.f_cpu=16000000L

WiringV1Sparkfun2561.menu.clock.8MHz=8 MHz Internal
WiringV1Sparkfun2561.menu.clock.8MHz.upload.speed=57600
WiringV1Sparkfun2561.menu.clock.8MHz.bootloader.low_fuses=0xE2
WiringV1Sparkfun2561.menu.clock.8MHz.build.f_cpu=8000000L

# BOD Menu
WiringV1Sparkfun2561.menu.BOD.2V7=2.7 V
WiringV1Sparkfun2561.menu.BOD.2V7.bootloader.extended_fuses=0xFD

WiringV1Sparkfun2561.menu.BOD.4V3=4.3 V
WiringV1Sparkfun2561.menu.BOD.4V3.bootloader.extended_fuses=0xFC

WiringV1Sparkfun2561.menu.BOD.1V8=1.8 V
WiringV1Sparkfun2561.menu.BOD.1V8.bootloader.extended_fuses=0xFE

WiringV1Sparkfun2561.menu.BOD.disabled=Disabled
WiringV1Sparkfun2561.menu.BOD.disabled.bootloader.extended_fuses=0xFF

# Bootloader Menu
WiringV1Sparkfun2561.menu.bootloader.wiring=Wiring
WiringV1Sparkfun2561.menu.bootloader.wiring.bootloader.BOOTSZ1=1
WiringV1Sparkfun2561.menu.bootloader.wiring.bootloader.BOOTSZ0=0
WiringV1Sparkfun2561.menu.bootloader.wiring.bootloader.BOOTRST=0
WiringV1Sparkfun2561.menu.bootloader.wiring.upload.protocol=wiring
WiringV1Sparkfun2561.menu.bootloader.wiring.upload.maximum_size=260096
WiringV1Sparkfun2561.menu.bootloader.wiring.bootloader.file=Wiring/WiringBoot_Wiring-V1.1-2561.hex

WiringV1Sparkfun2561.menu.bootloader.optiboot=Optiboot
WiringV1Sparkfun2561.menu.bootloader.optiboot.bootloader.BOOTSZ1=1
WiringV1Sparkfun2561.menu.bootloader.optiboot.bootloader.BOOTSZ0=1
WiringV1Sparkfun2561.menu.bootloader.optiboot.bootloader.BOOTRST=0
WiringV1Sparkfun2561.menu.bootloader.optiboot.upload.protocol=arduino
WiringV1Sparkfun2561.menu.bootloader.optiboot.upload.maximum_size=261120
WiringV1Sparkfun2561.menu.bootloader.optiboot.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex

WiringV1Sparkfun2561.menu.bootloader.none=None
WiringV1Sparkfun2561.menu.bootloader.none.bootloader.BOOTSZ1=1
WiringV1Sparkfun2561.menu.bootloader.none.bootloader.BOOTSZ0=1
WiringV1Sparkfun2561.menu.bootloader.none.bootloader.BOOTRST=1
WiringV1Sparkfun2561.menu.bootloader.none.upload.maximum_size=262144
WiringV1Sparkfun2561.menu.bootloader.none.bootloader.file=empty/empty_all.hex

# EESAVE Menu
WiringV1Sparkfun2561.menu.EESAVE.yes=Yes
WiringV1Sparkfun2561.menu.EESAVE.yes.bootloader.EESAVE=0

WiringV1Sparkfun2561.menu.EESAVE.no=No
WiringV1Sparkfun2561.menu.EESAVE.no.bootloader.EESAVE=1

# LTO Menu
WiringV1Sparkfun2561.menu.LTO.yes=Yes
WiringV1Sparkfun2561.menu.LTO.yes.compiler.c.extra_flags=-flto -fno-fat-lto-objects
WiringV1Sparkfun2561.menu.LTO.yes.compiler.c.elf.extra_flags=-flto -fuse-linker-plugin
WiringV1Sparkfun2561.menu.LTO.yes.compiler.S.extra_flags=-flto
WiringV1Sparkfun2561.menu.LTO.yes.compiler.cpp.extra_flags=-flto -DWIRINO_COMPILER_LTO
WiringV1Sparkfun2561.menu.LTO.yes.ltoarcmd=avr-gcc-ar

WiringV1Sparkfun2561.menu.LTO.no=No
WiringV1Sparkfun2561.menu.LTO.no.ltoarcmd=avr-ar

##############################################################
